{
  "format": "tfjs_layers_model",
  "generatedBy": "TensorFlow.js v4.10.0",
  "convertedBy": "TensorFlow.js converter",
  "signature": {},
  "modelTopology": {
    "keras_version": "3.3.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "sequential",
        "layers": [
          { "class_name": "InputLayer", "config": { "batch_input_shape": [null, 224, 224, 1], "dtype": "float32" }},
          { "class_name": "Conv2D", "config": { "filters": 32, "kernel_size": [3, 3], "activation": "relu" }},
          { "class_name": "MaxPooling2D", "config": { "pool_size": [2, 2] }},
          { "class_name": "Flatten" },
          { "class_name": "Dense", "config": { "units": 5, "activation": "softmax" }}
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        { "name": "conv2d/conv2d/kernel:0", "shape": [3, 3, 1, 32], "dtype": "float32" },
        { "name": "dense/dense/kernel:0", "shape": [112768, 5], "dtype": "float32" }
      ]
    }
  ]
}